//-Первое задание по подключению в VSCode
// Поэтому начинается с 2-го задания
//!- task-2
console.log('Запускаем таймер')
alert('5')
alert('4')
alert('3')
alert('2')
alert('1')
alert('0')
console.log('Обратный отсчет закончен')

//!-task-3
// Здесь задание по подключению еще 2-х файлов
//!-task-4
prompt('Сколько будет 2 + 2?');
alert('Ответ: если ты ответил 4, то ты прав.')
prompt('Чему равен корень из 9? ');
alert('Ответ: если ты ответил 3, то ты прав.')
prompt('Сколько будет 2 в 5-й степени? ');
alert('Ответ: если ты ответил 32, то ты прав.')